Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Wkp3VQRdnyoNAm0Jg+1d8G5HMW/djDlhDYgAcI9k8BZA0Qa7ifFFgS2z0fX/AL0uSl51sGXnckWG&#13;
vmyo/v+AHYP1YXhLEicxHVQYkDIrMFPA9SufXR8s5xZB8z+8aRFWWXHBtcmtV58mHRXKmBvC3pxM&#13;
A9yyRpZgDPaiLbEDVTHYSnFNprZ3zLLwTcDoB48UHqpMkLaX/VbKaxzLu0pav8xXXU0k69Mwc5yB&#13;
oWxX7td6iuj6RGn4FMGosREjpx2IOyCgsl+jke4thoM0L3phPkhlmtphLBv50/8qrWkoLiDHtyK5&#13;
5iXpB543kj3hZm76ql4AlzbtsgtErQMZKBO7XQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Nuyok8gFUpUf3xYBL48oXi5C7sxBrHtn3m8Ce6UASKRqmgTNMp0C1dPxwfSMNbMn1ZTzpsXd6B4r&#13;
m0/qhtS+oayElCdBJcb1MnpU9mghfvXhpQIasvz02UDpAgFjQkPnRKDAVcBiSvqvjzLbLj/WlhrQ&#13;
/Bs/LhyBUsm+Mf6xTNXefJx7hBCTff9MWfphayMzftH51670Gq7ZXE2W8HxRbiP1u2A2Rcl5mYA9&#13;
JrVHjhaX+zZLTSN6vTkvr2eLrXhURbwAKLULJs6s1pv/xN3taEi+xKGnBjb3paYw+o6qsL7Y0/nW&#13;
kltMKM6GNPiTvruU9XrWzMbIXiduLp972AABy/dQKuzBnKdBmmXiMXj4P8dyrgOkqfvu7EyJ3lLn&#13;
PvClBU+wecudLYNZS0TU4C1BuP5HcwlxOwzXLWv0FkGGKHrHPygdMN/tzTj70HPnMiImz9W6Jjbv&#13;
1CnhBVlFuT5PZFyDGbfpIfUoU4bAbNSFv5268GDzMrawGSlnloZ3R+EBLxc/al88gRFFDPfv487u&#13;
A0cw8ZMouhzZYexJKZ3ViUvsLeq4iwivPkeTNvXmBEk+7sfTPlBAZdY+BaY55DAtUpXGd5HcgD5Y&#13;
M1z2sg7zQ6MeAI1Gdw3rVwHZTUypUhJh1qvpM1Hk1uCam/IRujcggWrKPRqZQyU9fS8fOw1zUyTi&#13;
J5DoxMyQnSbGnlptwaVfC7XA01EPrJqu1s05vzt+KeXyJRr+iTAbERbFYEdB7gh1rgeFzdoMpuMV&#13;
7mYOz3V2s9aCsd1UCFFOXbnwbAgBL8BPs1gEzwGxWGQO+M41Kq4L/GoADw823c5Nbo7pQWp+nATc&#13;
vyPaWhjgO2iN/+UJC58ND1KVvWL3/ngd791gk9mzwyE5bjgN68mQrNydd5Y8hcymv0Dd+Uy6jMei&#13;
vlvE+PkSAjfOJal6X8kfYFcL1L91tA0yKfLkikEBpzOq+VjL</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>8qqIPUI8xu6hyvJKiS7cJUlRdP8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Y4anD7KgTDguw04Gk/KCfFd5M4BQJMBWBzs4xxh2guxBcbTYBuaiHUBNWZtX68LTLURlQ7aiyVWH&#13;
uRFfDmBLk2vts994/u6xHupSPfFmZCDIqQc7XREXX91TeqtdM+zxAo0cFJYtP8JkKkTL9TudYOGB&#13;
JyMntZTr/upgpEwaqvAb7u5qYelmgKe9MknV9b4EUI3wLxu8DTRvT7L44/S1XhRjHP8hx4WCqlih&#13;
s5a6NxV51uOxvf+t9Q8iZO6bzQny50b3nqyyDwdRaFu2zNSPM0rMKjbPYQ+VEg0rUP024M4+CI6e&#13;
zTzPC5uiQniiZLPSHCSx4xBXYAago2MU5+qM0g==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>